PANDAS 09

#9: Membagi data frame menjadi dua secara acak

In [ ]:
import pandas as pd
import numpy as np
print(pd.__version__)
print(np.__version__)

2.3.3
2.3.4

In [2]:
n_rows = 10
n_cols = 5
cols = tuple('ABCDE')

df = pd.DataFrame(np.random.randint(1, 20, size=(n_rows, n_cols)), 
                  columns=cols)
df

    A   B   C   D   E
0   6  11   4  16  13
1   6  19   7   1  17
2  11  15  11  18   4
3   2  19   3  14   6
4  14   8   5   8   2
5   3   5  19   1  12
6   8   7   7   1   3
7   7  14   4  13   9
8  13   3  17  12   6
9   7   7   9   7  16

Membagi data frame menjadi dua secara acak berdasarkan proporsi tertentu:

In [3]:
df.shape

(10, 5)

In [7]:
proporsi = 0.5
df_1 = df.sample(frac=proporsi)
df_2 = df.drop(df_1.index)

print(f'df_1 shape: {df_1.shape}')
print(f'df_2 shape: {df_2.shape}')

df_1 shape: (5, 5)
df_2 shape: (5, 5)

In [8]:
df_1

    A   B   C   D   E
1   6  19   7   1  17
0   6  11   4  16  13
6   8   7   7   1   3
8  13   3  17  12   6
9   7   7   9   7  16

In [9]:
df_2

    A   B   C   D   E
2  11  15  11  18   4
3   2  19   3  14   6
4  14   8   5   8   2
5   3   5  19   1  12
7   7  14   4  13   9

PANDAS 10

#10: Mengganti nama/label kolom pada data frame berdasarkan pola

In [10]:
import pandas as pd
print(pd.__version__)

2.3.3

In [18]:
df = pd.read_csv('titanicfull.csv')
df.columns = ['Pclass', 'Survival status', 'full Name', 'Sex  ', '  Age', 
              'Sib SP', 'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked']
df_backup = df.copy(deep=True)

df.head()

,Pclass,Survival status,full Name,Sex,Age,Sib SP,Parch,Ticket,Fare,Cabin,Embarked
0,1,1,"Allen, Miss. Elisabeth Walton",female,29.00,0,0,24160,211.3375,B5,S
1,1,1,"Allison, Master. Hudson Trevor",male,0.92,1,2,113781,151.5500,C22 C26,S
2,1,0,"Allison, Miss. Helen Loraine",female,2.00,1,2,113781,151.5500,C22 C26,S
3,1,1,"Allison, Mr. Hudson Joshua Creighton",male,30.00,1,2,113781,151.5500,C22 C26,S
4,1,1,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.00,1,2,113781,151.5500,C22 C26,S

Menggunakan lowercase untuk nama kolom dan mengganti spasi dengan _ (undersocre):

In [19]:
df.columns = df.columns.str.replace(' ', '_').str.lower()
df.head()

,pclass,survival_status,full_name,sex__,__age,sib_sp,parch,ticket,fare,cabin,embarked
0,1,1,"Allen, Miss. Elisabeth Walton",female,29.00,0,0,24160,211.3375,B5,S
1,1,1,"Allison, Master. Hudson Trevor",male,0.92,1,2,113781,151.5500,C22 C26,S
2,1,0,"Allison, Miss. Helen Loraine",female,2.00,1,2,113781,151.5500,C22 C26,S
3,1,1,"Allison, Mr. Hudson Joshua Creighton",male,30.00,1,2,113781,151.5500,C22 C26,S
4,1,1,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.00,1,2,113781,151.5500,C22 C26,S

Memangkas kelebihan spasi pada nama kolom:

In [20]:
df = df_backup.copy(deep=True)

df.columns = df.columns.str.lower().str.strip().str.replace(' ', '_')
df.head()

,pclass,survival_status,full_name,sex,age,sib_sp,parch,ticket,fare,cabin,embarked
0,1,1,"Allen, Miss. Elisabeth Walton",female,29.00,0,0,24160,211.3375,B5,S
1,1,1,"Allison, Master. Hudson Trevor",male,0.92,1,2,113781,151.5500,C22 C26,S
2,1,0,"Allison, Miss. Helen Loraine",female,2.00,1,2,113781,151.5500,C22 C26,S
3,1,1,"Allison, Mr. Hudson Joshua Creighton",male,30.00,1,2,113781,151.5500,C22 C26,S
4,1,1,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.00,1,2,113781,151.5500,C22 C26,S

PANDAS 11

#11: Seleksi kolom dan baris pada data frame menggunakan loc

In [21]:
n_rows = 10
n_cols = 5
cols = tuple('ABCDE')

df = pd.DataFrame(np.random.randint(1, 20, size=(n_rows, n_cols)), 
                  columns=cols)
df

    A   B   C   D   E
0   2  16  15   4   5
1  13  16  13  15  11
2  15  16  12   1   4
3  18   2   4   1  18
4  16  16  15  13   9
5   3  13  15  14  10
6  13   4  17  16  15
7   9  14   1  15   7
8   9  14  13   4  19
9   5   6   5   8  12

Seleksi kolom dan baris menggunakan loc:

In [22]:
df.loc[[0,3,4], ['B','E']]

    B   E
0  16   5
3   2  18
4  16   9

Seleksi baris dengan kondisi:

In [23]:
df.loc[df['B']>10, ['B','D','E']]

    B   D   E
0  16   4   5
1  16  15  11
2  16   1   4
4  16  13   9
5  13  14  10
7  14  15   7
8  14   4  19

Slicing data frame dengan loc:

In [24]:
df.loc[0:4, 'B':'D']

    B   C   D
0  16  15   4
1  16  13  15
2  16  12   1
3   2   4   1
4  16  15  13

PANDAS 12

#12: Membentuk kolom bertipe datetime dari beberapa kolom lain pada Pandas data frame

In [ ]:
data = {'day':[1, 2, 10 ,25, 12], 
        'month':[1, 2, 4, 5, 6], 
        'year':[2000, 2001, 2010, 2015, 2020]}

df = pd.DataFrame(data)
df

   day  month  year
0    1      1  2000
1    2      2  2001
2   10      4  2010
3   25      5  2015
4   12      6  2020

Membentuk kolom bertipe datetime:

In [26]:
df['penaggalan'] = pd.to_datetime(df[['day', 'month', 'year']])
df

   day  month  year penaggalan
0    1      1  2000 2000-01-01
1    2      2  2001 2001-02-02
2   10      4  2010 2010-04-10
3   25      5  2015 2015-05-25
4   12      6  2020 2020-06-12

In [28]:
df.dtypes

day                    int64
month                  int64
year                   int64
penaggalan    datetime64[ns]
dtype: object